app/views/students/edit.html.erb

SELECT "schools".* FROM "schools"
---
    <%=f.number_field :age%>
    <%=select_tag 'school_id', options_from_collection_for_select(School.all, 'id', 'name')%>