app/views/students/new.html.erb

    <%=number_field_tag 'student[age]', 0%>
    <%=select_tag 'school_id', options_from_collection_for_select(School.all, 'id', 'name')%>
---
SELECT "schools".* FROM "schools"