app/views/schools/index.html.erb

    <li>
      <%=link_to school.name, school_path(school)%>, <%=pluralize(school.student.length, 'students')%>
---
SELECT "students".* FROM "students" WHERE "students"."school_id" = ?  [["school_id", 41]]