app/views/schools/show.html.erb


<%@school.student.all.each_with_index do |student, i|%>
---
SELECT "students".* FROM "students" WHERE "students"."school_id" = ?  [["school_id", 4]]