app/controllers/schools_controller.rb

  def index
    @schools = School.all
---
SELECT "schools".* FROM "schools"

  def show
    # byebug
    @school = School.find(params[:id])
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

  def delete_student
    # byebug
    @student = Student.find(params[:student_id])
    @student.delete
---
SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "students" WHERE "students"."id" = ?  [["id", 3]]