app/controllers/students_controller.rb

SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT ?  [["id", 41], ["LIMIT", 1]]
INSERT INTO "students" ("name", "age", "created_at", "updated_at", "school_id") VALUES (?, ?, ?, ?, ?)  [["name", "qdd"], ["age", 12], ["created_at", "2019-07-02 17:09:02.018830"], ["updated_at", "2019-07-02 17:09:02.018830"], ["school_id", 41]]
---
  def create
    @school = School.find(params[:school_id])
    # byebug
    @student = @school.student.create!(student_params(params))

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "students" SET "age" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["age", 145], ["updated_at", "2019-07-02 18:50:57.465048"], ["id", 1]]
---
  def update
    @student = Student.find(params[:id])
    @student.update!(student_params(params))